In [ ]:
import pandas as pd

Creating a data frame with details of 10 students and columns as Roll Number, Name, Gender, Marks1, Marks2, Marks3.

In [ ]:
marks_dataset={'ROLL NO':[1,2,3,4,5,6,7,8,9,10],
               'NAME': ['Pallavini','Iqbal','Bhargavi','Sachin','Aparna','Sambhav','Madhuri','Balbir','Udaya','Dhanraj'],
               'GENDER':['Female','Male','Female','Male','Female','Male','Female','Male','Female','Male'],
               'MARKS1':[45,34,67,32,56,27,46,35,24,20],
               'MARKS2':[89,56,76,58,89,67,78,45,46,34],
               'MARKS3':[90,78,95,70,99,87,96,67,55,57]}
marks_dataset= pd.DataFrame(marks_dataset)  
marks_dataset

   ROLL NO       NAME  GENDER  MARKS1  MARKS2  MARKS3
0        1  Pallavini  Female      45      89      90
1        2      Iqbal    Male      34      56      78
2        3   Bhargavi  Female      67      76      95
3        4     Sachin    Male      32      58      70
4        5     Aparna  Female      56      89      99
5        6    Sambhav    Male      27      67      87
6        7    Madhuri  Female      46      78      96
7        8     Balbir    Male      35      45      67
8        9      Udaya  Female      24      46      55
9       10    Dhanraj    Male      20      34      57

Create a new column with total marks

In [ ]:
marks_dataset["TOTAL MARKS"]=marks_dataset.sum(axis=1)
marks_dataset

   ROLL NO       NAME  GENDER  MARKS1  MARKS2  MARKS3  TOTAL MARKS
0        1  Pallavini  Female      45      89      90          225
1        2      Iqbal    Male      34      56      78          170
2        3   Bhargavi  Female      67      76      95          241
3        4     Sachin    Male      32      58      70          164
4        5     Aparna  Female      56      89      99          249
5        6    Sambhav    Male      27      67      87          187
6        7    Madhuri  Female      46      78      96          227
7        8     Balbir    Male      35      45      67          155
8        9      Udaya  Female      24      46      55          134
9       10    Dhanraj    Male      20      34      57          121

Lowest marks in Marks1

In [ ]:
#To find the minimum marks in MARKS1
column = marks_dataset["MARKS1"]
min_value = column. min() #get min value from "Marks1"
print(min_value)

20

Highest marks in Marks2

In [ ]:
#To find the maximum marks in MARKS2
column = marks_dataset["MARKS2"]
max_value = column. max() #get max value from "Marks2"
print(max_value)

89

Average marks in Marks3

In [ ]:
#To find the average marks in MARKS3
column = marks_dataset["MARKS3"]
avg_value = column. mean() #get average value from "Marks3"
print(avg_value)

79.4

Student name with highest average

In [ ]:
marks_dataset[["NAME","TOTAL MARKS"]].max()

NAME           Udaya
TOTAL MARKS      249
dtype: object

Since ,if the student has highest "Total marks" among the other students, it clearly means that his/her average marks will be the greatest

Students failed in Marks2 (<40)

In [ ]:
marks_dataset[marks_dataset["MARKS2"]<40]

   ROLL NO     NAME GENDER  MARKS1  MARKS2  MARKS3  TOTAL MARKS
9       10  Dhanraj   Male      20      34      57          121

Inference= Only 1 student, named:Dhanraj, failed in Marks2